src/InformationRegisters/ПорядокЗакрытияБалансовыхСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПорядокЗакрытияБалансовыхСтатей</Name>
			<Comment>Порядок распределения статей доходов и расходов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Comment>Порядок закрытия статьи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Comment>Статья</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ПорядокЗакрытияБалансовыхСтатей/Ext/ManagerModule.bsl
// Модуль менеджера регистра сведений "Порядок закрытия балансовых статей"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	// Получим макет
	Макет = РегистрыСведений.ПорядокЗакрытияБалансовыхСтатей.ПолучитьМакет("НастройкиПоУмолчанию");
	Если Макет = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не обнаружен макет начальных настроек.'");
		Возврат;
	КонецЕсли;
	
	// Добавление статей
	НаборЗаписей = РегистрыСведений.ПорядокЗакрытияБалансовыхСтатей.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НастроенныеСтатьи = НаборЗаписей.ВыгрузитьКолонку("Статья");
	
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		
		// Считаем из макета Статья, Порядок
		СтрСтатья  = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрПорядок = СокрЛП(Макет.Область(НомерСтроки,2).Текст);
		
		// Получим статью
		Попытка
			Статья = Справочники.СтатьиДоходовИРасходов[СтрСтатья];
		Исключение
			Продолжить;
		КонецПопытки;
		
		// Получим порядок
		Порядок = Число(СтрПорядок);
		
		// Добавим запись
		Если НастроенныеСтатьи.Найти(Статья)=Неопределено Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Статья  = Статья;
			НоваяЗапись.Порядок = Порядок;
		КонецЕсли;
		
	КонецЦикла;
	
	// Сохраним порядок распределения статей доходов и расходов
	Если НаборЗаписей.Модифицированность() Тогда
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
